ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0gx218_gx207/UC5_I2CT_1.0.xml
    <register id="UC5_I2CT_ACKCTL" width="32" offset="0x1104" description="I2C Target ACK Control">
        <bitfield id="ACKOEN" description="I2C Target ACK Override Enable  
Read SR.ACKOEN to check current status of this bit" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="A response in not provided."/>
            <bitenum id="ENABLE" value="0x1" description="An ACK or NACK is sent according to the value written to the ACKOVAL bit."/>
        </bitfield>
        <bitfield id="ACKOVAL" description="ACK Override Value
Note: Override control is not applicable to Address frame. Bytes following address frame can be acknowledged using ACKOVAL." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="An ACK is sent indicating valid data or command."/>
            <bitenum id="ENABLE" value="0x1" description="A NACK is sent indicating invalid data or command."/>
        </bitfield>
        <bitfield id="ACKOEN_ON_START" description="When set this bit will automatically enable target override acknowlede following a Start Condition. Status bit ACKOEN will reflect a value of '1' when automatic override enable is used." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No special behavior"/>
            <bitenum id="ENABLE" value="0x1" description="When set this bit will automatically turn on the Target ACKOEN field following a Start Condition."/>
        </bitfield>
        <bitfield id="ACKOEN_ON_PECNEXT" description="When set this bit will automatically turn on the Target acknowledge override following a ACK/NACK of the byte received just prior to the PEC byte.
However, setting ACKCTL.ACKOEN bit will not automatically be ACKed/NACKed by the State Machine and firmware must perform this function by writing Target.ACKCTL register.
Status bit ACKOEN will reflect a value of '1' when automatic override enable is used." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No special behavior"/>
            <bitenum id="ENABLE" value="0x1" description="When set this bit will automatically turn on the Target ACKOEN field following the ACK/NACK of the byte received just prior to the PEC byte.
Note that when ACKOEN is set the PEC byte will not automatically be ACKed/NACKed by the State Machine and FW must perform this function by writing Target_SACKCTL."/>
        </bitfield>
        <bitfield id="ACKOEN_ON_PECDONE" description="When set, this bit will automatically turn on target acknowledge enable field following the ACK/NACK of the received PEC byte. Status bit ACKOEN will reflect a value of '1' when automatic override enable is used." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No special behavior"/>
            <bitenum id="ENABLE" value="0x1" description="When set this bit will automatically turn on the Target ACKOEN field following the ACK/NACK of the received PEC byte."/>
        </bitfield>
    </register>
    <register id="UC5_I2CT_SR" width="32" offset="0x1108" description="Status Register">
        <bitfield id="RREQ" description="Receive Request" begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="No outstanding receive data."/>
            <bitenum id="SET" value="0x1" description="Module has outstanding receive data and is using clock stretching to delay the Controller until the data has been read from the RXDATA FIFO (RX FIFO is full)."/>
        </bitfield>
        <bitfield id="TREQ" description="Transmit Request" begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="No outstanding transmit request."/>
            <bitenum id="SET" value="0x1" description="I2C Target is addressed as a transmitter and is using clock stretching to delay the Controller until data has been written to the TXDATA FIFO (TX FIFO is empty)."/>
        </bitfield>
        <bitfield id="OAR2SEL" description="OAR2 Address Matched This bit gets reevaluated after every address comparison." begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="Either the OAR2 address is not matched or the match is in legacy mode."/>
            <bitenum id="SET" value="0x1" description="OAR2 address matched and ACKed by the Target."/>
        </bitfield>
        <bitfield id="QCMDST" description="Quick Command Status
Value Description:
0: The last transaction was a normal transaction or a transaction has not occurred.
1: The last transaction was a Quick Command transaction" begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The last transaction was a normal transaction or a transaction has not occurred."/>
            <bitenum id="SET" value="0x1" description="The last transaction was a Quick Command transaction."/>
        </bitfield>
        <bitfield id="QCMDRW" description="Quick Command Read / Write 
This bit only has meaning when the QCMDST bit is set. 
Value Description:
0: Quick command was a write
1: Quick command was a read" begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="Quick command was a write"/>
            <bitenum id="SET" value="0x1" description="Quick command was a read"/>
        </bitfield>
        <bitfield id="RXMODE" description="Target FSM is in Rx MODE" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="CLEARED" value="0x0" description="The Target State Machine is not in the RX_DATA, RX_ACK, RX_WAIT, RX_ACK_WAIT or ADDR_ACK state with the bus direction set to write."/>
            <bitenum id="SET" value="0x1" description="The Target State Machine is in the RX_DATA, RX_ACK, RX_WAIT, RX_ACK_WAIT or ADDR_ACK state with the bus direction set to write."/>
        </bitfield>
        <bitfield id="BUSBSY" description="I2C bus is busy" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="CLEARED" value="0x0" description="The I2C Bus is not busy"/>
            <bitenum id="SET" value="0x1" description="The I2C Bus is busy. This is cleared on a timeout."/>
        </bitfield>
        <bitfield id="TXMODE" description="FSM is in TX MODE" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="CLEARED" value="0x0" description="State Machine is not in TX_DATA, TX_WAIT, TX_ACK  or ADDR_ACK state with the bus direction set to read."/>
            <bitenum id="SET" value="0x1" description="State Machine is in TX_DATA, TX_WAIT, TX_ACK  or ADDR_ACK state with the bus direction set to read."/>
        </bitfield>
        <bitfield id="STALE_TXFIFO" description="Stale Tx FIFO" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="CLEARED" value="0x0" description="Tx FIFO is not stale"/>
            <bitenum id="SET" value="0x1" description="The TX FIFO is stale. This occurs when the TX FIFO was not emptied during the previous I2C transaction."/>
        </bitfield>
        <bitfield id="ADDRMATCH" description="Indicates the address for which Target address match happened" begin="25" end="16" width="10" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
            <bitenum id="MAXIMUM" value="0x3FF" description="Maximum Value"/>
        </bitfield>
        <bitfield id="RXCLR" description="RX FIFO Clear Status" begin="9" end="9" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="FIFO is not cleared"/>
            <bitenum id="SET" value="0x1" description="FIFO clear is complete"/>
        </bitfield>
        <bitfield id="TXCLR" description="TX FIFO Clear Status" begin="10" end="10" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="FIFO is not cleared"/>
            <bitenum id="SET" value="0x1" description="FIFO clear is complete"/>
        </bitfield>
        <bitfield id="RXFE" description="Receive FIFO Empty  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="11" end="11" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The receiver is not empty."/>
            <bitenum id="SET" value="0x1" description="If the FIFO is disabled (FEN is 0), the receive holding register is empty. If the FIFO is enabled (FEN is 1), the receive FIFO is empty."/>
        </bitfield>
        <bitfield id="RXFF" description="Receive FIFO Full  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="12" end="12" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The receiver can receive data."/>
            <bitenum id="SET" value="0x1" description="If the FIFO is disabled (FEN is 0), the receive holding register is full. If the FIFO is enabled (FEN is 1), the receive FIFO is full."/>
        </bitfield>
        <bitfield id="TXFE" description="Transmit FIFO Empty  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="13" end="13" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The transmitter has data to transmit."/>
            <bitenum id="SET" value="0x1" description="If the FIFO is disabled (FEN is 0), the transmit holding register is empty. If the FIFO is enabled (FEN is 1), the transmit FIFO is empty."/>
        </bitfield>
        <bitfield id="TXFF" description="Transmit FIFO Full  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="14" end="14" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The transmitter is not full."/>
            <bitenum id="SET" value="0x1" description="If the FIFO is disabled (FEN is 0), the transmit holding register is full. If the FIFO is enabled (FEN is 1), the transmit FIFO is full."/>
        </bitfield>
        <bitfield id="ACKOEN" description="Status of ACK Override Enable" begin="15" end="15" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="ACK override is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="ACK override was enabled in design"/>
        </bitfield>
    </register>
    <register id="UC5_I2CT_IFLS" width="32" offset="0x110C" description="Interrupt FIFO Level Select Register">
        <bitfield id="TXIFLSEL" description="FIFO Level Select for generating events (interrupt/dma). 
Note: for undefined settings the default configuration is used." begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="LVL_3_4" value="0x1" description="TX FIFO &lt;= 3/4 empty"/>
            <bitenum id="LVL_1_2" value="0x2" description="TX FIFO &lt;= 1/2 empty (default)"/>
            <bitenum id="LVL_1_4" value="0x3" description="TX FIFO &lt;= 1/4 empty"/>
            <bitenum id="LVL_NOT_FULL" value="0x4" description="Opposite of full"/>
            <bitenum id="LVL_EMPTY" value="0x5" description="TX FIFO is empty"/>
            <bitenum id="LVL_ALMOST_EMPTY" value="0x6" description="TX FIFO &lt;= 1"/>
            <bitenum id="LVL_ALMOST_FULL" value="0x7" description="TX_FIFO &gt;= (MAX_FIFO_LEN -1)"/>
        </bitfield>
        <bitfield id="RXIFLSEL" description="FIFO Level Select for generating events (interrupt/dma). 
Note: for undefined settings the default configuration is used." begin="6" end="4" width="3" rwaccess="R/W">
            <bitenum id="LVL_1_4" value="0x1" description="RX FIFO &gt;= 1/4 full"/>
            <bitenum id="LVL_1_2" value="0x2" description="RX FIFO &gt;= 1/2 full (default)"/>
            <bitenum id="LVL_3_4" value="0x3" description="RX FIFO &gt;= 3/4 full"/>
            <bitenum id="LVL_NOT_EMPTY" value="0x4" description="Opposite of empty"/>
            <bitenum id="LVL_FULL" value="0x5" description="RX FIFO is full"/>
            <bitenum id="LVL_ALMOST_FULL" value="0x6" description="RX_FIFO &gt;= (MAX_FIFO_LEN -1)"/>
            <bitenum id="LVL_ALMOST_EMPTY" value="0x7" description="RX_FIFO &lt;= 1"/>
        </bitfield>
        <bitfield id="TXCLR" description="TX FIFO CLEAR. Setting this bit will clear the TX FIFO contents." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable FIFO clear"/>
            <bitenum id="ENABLE" value="0x1" description="Enable FIFO Clear"/>
        </bitfield>
        <bitfield id="RXCLR" description="RX FIFO CLEAR. Setting this bit will clear the RX FIFO contents." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable FIFO clear"/>
            <bitenum id="ENABLE" value="0x1" description="Enable FIFO Clear"/>
        </bitfield>
    </register>
    <register id="UC5_I2CT_GFCTL" width="32" offset="0x1118" description="I2C Glitch Filter Control">
        <bitfield id="AGFEN" description="Analog Glitch Suppression Enable" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Analog Glitch Filter disable"/>
            <bitenum id="ENABLE" value="0x1" description="Analog Glitch Filter enable"/>
        </bitfield>
    </register>
    <register id="UC5_I2CT_TTXDATA" width="32" offset="0x1120" description="I2C TXData">
        <bitfield id="DATA" description="Transmit Data
This byte contains the data to be transferred during the next transaction." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC5_I2CT_RXDATA" width="32" offset="0x1124" description="I2C RXData">
        <bitfield id="DATA" description="Received Data. 
This field contains the last received data." begin="7" end="0" width="8" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC5_I2CT_PECSR" width="32" offset="0x1128" description="PEC status register">
        <bitfield id="PECBYTECNT" description="This is the current PEC Byte Count of the State Machine." begin="8" end="0" width="9" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
            <bitenum id="MAXIMUM" value="0x1FF" description="Maximum Value"/>
        </bitfield>
        <bitfield id="PECSTS_CHECK" description="This status bit indicates if the PEC was checked in the transaction that occurred before the last Stop. Latched on Stop." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="CLEARED" value="0x0" description="Indicates PEC was not checked in the transaction that occurred before the last Stop"/>
            <bitenum id="SET" value="0x1" description="Indicates PEC was checked in the transaction that occurred before the last Stop"/>
        </bitfield>
        <bitfield id="PECSTS_ERROR" description="This status bit indicates if a PEC check error occurred in the transaction that occurred before the last Stop. Latched on Stop." begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="CLEARED" value="0x0" description="Indicates PEC check error did not occurr in the transaction that occurred before the last Stop"/>
            <bitenum id="SET" value="0x1" description="Indicates PEC check error occurred in the transaction that occurred before the last Stop"/>
        </bitfield>
    </register>
    <register id="UC5_I2CT_OAR2" width="32" offset="0x1148" description="Own Address 2">
        <bitfield id="OAR2" description="Own Address 2This field specifies the alternate OAR2 address." begin="6" end="0" width="7" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x7F" description="Highest possible value"/>
        </bitfield>
        <bitfield id="OAR2EN" description="Own Address 2 Enable" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The alternate address is disabled."/>
            <bitenum id="ENABLE" value="0x1" description="Enables the use of the alternate address in the OAR2 field."/>
        </bitfield>
        <bitfield id="OAR2_MASK" description="Own Address 2 Mask: This field specifies bits A6 through A0 of the Target address.
The bits with value 1 in SOAR2.OAR2_MASK field will make the corresponding incoming address bits to match by default regardless of the value inside SOAR2.OAR2 i.e. corresponding SOAR2.OAR2 bit is a dont care." begin="22" end="16" width="7" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
            <bitenum id="MAXIMUM" value="0x7F" description="Maximum Value"/>
        </bitfield>
    </register>
    <register id="UC5_I2CT_OAR" width="32" offset="0x114C" description="I2C Own Address">
        <bitfield id="OAR" description="Own Address: This field specifies bits A9 through A0 of the Target address.
In 7-bit addressing mode as selected by I2CSOAR.MODE bit, the top 3 bits are don't care" begin="9" end="0" width="10" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3FF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="OAREN" description="Own Address Enable" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable OAR address"/>
            <bitenum id="ENABLE" value="0x1" description="Enable OAR address"/>
        </bitfield>
        <bitfield id="MODE" description="This bit selects the adressing mode to be used.
When 0, 7-bit addressing is used.
When 1, 10-bit addressing is used." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="MODE7" value="0x0" description="Enable 7-bit addressing"/>
            <bitenum id="MODE10" value="0x1" description="Enable 10-bit addressing"/>
        </bitfield>
    </register>
